Процедура ЧтениеExcel_через_ТД(ВыбранныйФайл)

    ТаблДок = Новый ТабличныйДокумент;
    ТаблДок.Прочитать(ВыбранныйФайл, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	ТаблДок.ВставитьОбласть(ТаблДок.Область("R1"), ТаблДок.Область("R1"), ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	ТаблДок.Область("R1C1").СодержитЗначение = Ложь;
	ТаблДок.Область("R1C1").Текст = "ШтрихКод";
	ТаблДок.Область("R1C2").СодержитЗначение = Ложь;
	ТаблДок.Область("R1C2").Текст = "Код";
	ТаблДок.Область("R1C3").СодержитЗначение = Ложь;
	ТаблДок.Область("R1C3").Текст = "Номенклатура";

	ПЗ = Новый ПостроительЗапроса;
	ПЗ.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблДок.Область());
	ПЗ.ДобавлениеПредставлений = ТипДобавленияПредставлений.НеДобавлять;
	ПЗ.ЗаполнитьНастройки();
	ПЗ.Выполнить();

	ТаблицаЗначений = ПЗ.Результат.Выгрузить();
	
	НаборШК = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
	
	Для Каждого СтрокаТЗ ИЗ ТаблицаЗначений Цикл
		Если СтрокаТЗ.ШтрихКод <> "" Тогда			
			КодТовара = СтрокаТЗ.Код;
			Номенклатура = Справочники.Номенклатура.НайтиПоКоду(КодТовара);
			Если НЕ Номенклатура.Пустая() Тогда  
				СтруктураТЗДляЗагрузки = Новый Структура();
				СтруктураТЗДляЗагрузки.Вставить("Владелец", Номенклатура);
				СтруктураТЗДляЗагрузки.Вставить("Штрихкод", СтрЗаменить(СтрокаТЗ.ШтрихКод, Символы.НПП, ""));
				СтруктураТЗДляЗагрузки.Вставить("ТипШтрихкода", ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13);
				СтруктураТЗДляЗагрузки.Вставить("ЕдиницаИзмерения", Номенклатура.ЕдиницаХраненияОстатков);
				СтруктураТЗДляЗагрузки.Вставить("Качество", Справочники.Качество.Новый); 
				
				ТЗДляЗагрузки = Новый ТаблицаЗначений;
				Для Каждого КлючЗначение из СтруктураТЗДляЗагрузки Цикл 
					ТЗДляЗагрузки.Колонки.Добавить(КлючЗначение.Ключ);
				КонецЦикла;
				ЗаполнитьЗначенияСвойств(ТЗДляЗагрузки.Добавить(), СтруктураТЗДляЗагрузки);
				
				НаборШК.Отбор.Владелец.Установить(Номенклатура);
				НаборШК.Прочитать();
				НаборШК.Очистить();
				НаборШК.Записать();
				НаборШК.Загрузить(ТЗДляЗагрузки);	
				НаборШК.Записать();

				//ТестКоммит
				НаборШК.Прочитать();
				
				//Еще один тест ЛМ
				НаборШК.Записать();

			КонецЕсли; 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура КнопкаВыполнитьНажатие(Кнопка)
	ЧтениеExcel_через_ТД(ПолеВвода1);
	Сообщить("Загрузка выполнена!");
КонецПроцедуры

Процедура ПолеВвода1НачалоВыбора(Элемент, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Заголовок = "Выберите файл Excel";
    Диалог.ПредварительныйПросмотр = Ложь;
    Диалог.Фильтр = "(*.xls,*.xlsx)|*.xls;*.xlsx;|Microsoft Excel 97/2000/XP/2003 (*.xls)|*.xls|Microsoft Excel 2007/2010 (*.xlsx)|*.xlsx";

    Если Диалог.Выбрать() Тогда
        ВыбранныйФайл = Диалог.ПолноеИмяФайла;
        ПолеВвода1 = ВыбранныйФайл;
    КонецЕсли;

КонецПроцедуры
